package com.example.principiacustodes;

import java.security.MessageDigest;
import java.security.NoSuchAlgorithmException;
import java.util.Scanner;

public class AES256 {
    /*
    * Посвящение
Вы вновь со мной, туманные виденья,
Мне в юности мелькнувшие давно...
Вас удержу ль во власти вдохновенья?
Былым ли снам явиться вновь дано?
Из сумрака, из тьмы полузабвенья
Восстали вы... О, будь, что суждено!
Как в юности, ваш вид мне грудь волнует,
И дух мой снова чары ваши чует.

Вы принесли с собой воспоминанье
Весёлых дней и милых теней рой;
Воскресло вновь забытое сказанье
Любви и дружбы первой предо мной;
Всё вспомнилось: и прежнее страданье,
И жизни бег запутанной чредой,
И образы друзей, из жизни юной
Исторгнутых, обманутых фортуной.



Кому я пел когда-то, вдохновенный,
Тем песнь моя - увы! - уж не слышна...
Кружок друзей рассеян по вселенной,
Их отклик смолк, прошли те времена.
Я чужд толпе со скорбью, мне священной,
Мне самая хвала её страшна,
А те, кому моя звучала лира,
Кто жив ещё, - рассеяны средь мира.

И вот воскресло давнее стремленье
Туда, в мир духов, строгий и немой,
И робкое родится песнопенье,
Стеня, дрожа эоловой струной;
В суровом сердце трепет и смиренье,
В очах слеза сменяется слезой;
Всё, чем владею, вдаль куда-то скрылось;
Всё, что прошло, - восстало, оживилось!..



Пролог в театре
Директор, поэт и комик.

Директор

Друзья, вы оба мне не раз
Помочь умели в горькой доле;
Как ваше мненье: хорошо ли
Пойдут дела теперь у нас?
Тружусь для публики я неизменно:
Она живёт и жить другим даёт.
Уже стоят столбы,  готова сцена,
Ждёт праздника взволнованный народ.
У нас ведь все к чудесному стремятся:
Глядят во все глаза и жаждут удивляться.
Мне угождать толпе хоть и не новый труд,
Но всё ж меня берёт невольное сомненье:
Прекрасного они, конечно, не поймут,
Зато начитаны они до пресыщенья.
Вот дать бы пьесу нам поярче, поновей,
Посодержательней - для публики моей!
А ведь приятен вид толпы необозримой,
Когда она вокруг театра наводнит
Всю площадь и бежит волной неудержимой,
И в двери тесные и рвётся и спешит.
Нет четырёх часов, до вечера далёко,
А уж толпа кишит, пустого места нет -
Точь-в-точь голодные пред лавкой хлебопека,
И шею все сломить готовы за билет.
Такие чудеса во власти лишь поэта!
Мой друг, теперь прошу: скорей ты сделай это.

Поэт

Не говори мне о толпе безумной -
Она иной раз вдохновение спугнёт;
Избавь меня от этой давки шумной,
Влекущей мощно в свой водоворот;
Нет, тишины ищу я, многодумный, -
Лишь там поэту радость расцветёт;
Там, только там божественною властью
Любовь и дружба нас приводит к счастью.

Что в глубине сердечной грудь лелеет,
Что просится на робкие уста -
Удачно ль, нет ли, - выйти чуть посмеет
На свет - его погубит суета!
Нет, лучше пусть годами дума зреет,
Чтоб совершенной стала красота!
Мишурный блеск - созданье вероломства,
Прекрасное родится для потомства!

Комик

Потомство! Вот о чём мне речи надоели!
Что, если б для него - потомства - в самом деле
И я бы перестал смешить честной народ?
Кто ж публику тогда, скажите, развлечёт
Весёлой шуткою, ей нужной, без сомненья?..
Нет, как хотите, а держусь я мненья,
Что весельчак заслужит свой почёт
И что забавник не лишён значенья.
Кто интересен публике, мой друг,
Тот говорить с толпою может смело;
Увлечь её - ему пустое дело.
Успех тем легче, чем обширней круг!
Итак, смелей вперёд! Вы можете заставить
Фантазию, любовь, рассудок, чувство, страсть
На сцену выступить; но не забудьте часть
И шаловливого дурачества прибавить. */
}
